# 풀이 출처: https://www.youtube.com/watch?v=UlHUK2STX40
import sys
input=sys.stdin.readline
#    시작  1  2  3  4  5
#         6  7  8  9  10  11  12  13  14  15
#         16  17  18  19  20
#         21  22  23  24  25  26
#         27  28  29  30  31  32(도착)
adj=[[1],[2],[3],[4],[5],[6,21],
     [7],[8],[9],[10],[11,27],[12],[13],[14],[15],[16,29],
     [17],[18],[19],[20],[32],
     [22],[23],[24],[25],[26],[20],
     [28],[24],[30],[31],[24],[32]]
score=[0,2,4,6,8,10,
       12,14,16,18,20,22,24,26,28,30,
       32,34,36,38,40,
       13,16,19,25,30,35,
       22,24,28,27,26,0]

def dfs(n,sm):
    global ans
    # 종료 조건 (10턴 완료)
    if n==10:
        ans=max(ans,sm)
        return

    # 하부 호출
    for j in range(4):
        s=v[j] # j번 말의 현재 위치
        e=adj[s][-1] # 한 칸 이동 (주사위는 1~5의 숫자)
        # 남은 칸 이동
        for _ in range(1,arr[n]):
            e=adj[e][0]
        # 목적지이거나, 다른 말이 이동하려는 칸에 없는 경우에만 이동 가능
        if e==32 or (e not in v):
            v[j]=e
            dfs(n+1,sm+score[e])
            v[j]=s

arr=list(map(int,input().rstrip().split()))
v=[0,0,0,0]
ans=0
dfs(0,0)
print(ans)